#ifndef __FPUTILS_H__
#define __FPUTILS_H__

/*******************************************************************************
                                 ФОРМАТЫ ЧИСЕЛ

ВХОДНЫЕ ФОРМАТ:
- 1.31 (Q31)
  1 бит целой части     31 бит дробной части
  Диапазон:   [-1.0; 1.0]
  Точность:   1/2^31

- 1.15 (Q15)
  1 бит целой части     15 бит дробной части
  Дипазон:    [-1.0; 1.0]
  Точность:   1/2^15

ВЫХОДНЫЕ ФОРМАТЫ:
Точность результата уменьшается на размер FFT

                1.31
 -------|-----------------|------------------|----------|
 Размер | Выходной формат | Диапазон         | Точность |
 -------|-----------------|------------------|----------|
 16     |      5.27       | [-32.0; 32.0]    | 1/2^27   |
 32     |      6.26       | [-32; 32]        | 1/2^26   |
 64     |      7.25       | [-64; 64]        | 1/2^25   |
 128    |      8.24       | [-128; 128]      | 1/2^24   |
 256    |      9.23       | [-256; 256]      | 1/2^23   |
 512    |     10.22       | [-512; 512]      | 1/2^22   |
 1024   |     11.21       | [-1024; 1024]    | 1/2^21   |
 2048   |     12.20       | [-2048; 2048]    | 1/2^20   |
 4096   |     13.19       | [-4096; 4096]    | 1/2^19   |
  
*******************************************************************************/

//                       МАКРОСЫ ПЕРЕВОДА

// Из float
#define F_Q31(v)(v * INT_MAX)
#define F_Q15(v)(v * SHRT_MAX)

// В float
#define Q31_F(v)(v /(float)INT_MAX)
#define Q15_F(v)(v / (float)SHRT_MAX)

#define Q5_27_F(v)(v / (float)134217727)
#define Q6_26_F(v)(v / (float)67108863)
#define Q7_25_F(v)(v / (float)33554431)
#define Q8_24_F(v)(v / (float)16777215)
#define Q9_23_F(v)(v / (float)8388607)
#define Q10_22_F(v)(v / (float)4194303)
#define Q11_21_F(v)(v / (float)2097151)
#define Q12_20_F(v)(v / (float)1048575)
#define Q13_19_F(v)(v / (float)524287)


#endif
